sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/mm_reg/mjpeg_reg_a0.h
/**
  ******************************************************************************
  * @file    mjpeg_reg.h
  * @version V1.2
  * @date    2019-08-05
  * @brief   This file is the description of.IP register
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2018 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef  __MJENC_REG_H__
#define  __MJENC_REG_H__

#include "bl808.h"

/* 0x0 : mjpeg_control_1 */
#define MJENC_MJPEG_CONTROL_1_OFFSET                            (0x0)
#define MJENC_REG_MJPEG_ENABLE                                  MJENC_REG_MJPEG_ENABLE
#define MJENC_REG_MJPEG_ENABLE_POS                              (0U)
#define MJENC_REG_MJPEG_ENABLE_LEN                              (1U)
#define MJENC_REG_MJPEG_ENABLE_MSK                              (((1U<<MJENC_REG_MJPEG_ENABLE_LEN)-1)<<MJENC_REG_MJPEG_ENABLE_POS)
#define MJENC_REG_MJPEG_ENABLE_UMSK                             (~(((1U<<MJENC_REG_MJPEG_ENABLE_LEN)-1)<<MJENC_REG_MJPEG_ENABLE_POS))
#define MJENC_REG_MJPEG_BIT_ORDER                               MJENC_REG_MJPEG_BIT_ORDER
#define MJENC_REG_MJPEG_BIT_ORDER_POS                           (1U)
#define MJENC_REG_MJPEG_BIT_ORDER_LEN                           (1U)
#define MJENC_REG_MJPEG_BIT_ORDER_MSK                           (((1U<<MJENC_REG_MJPEG_BIT_ORDER_LEN)-1)<<MJENC_REG_MJPEG_BIT_ORDER_POS)
#define MJENC_REG_MJPEG_BIT_ORDER_UMSK                          (~(((1U<<MJENC_REG_MJPEG_BIT_ORDER_LEN)-1)<<MJENC_REG_MJPEG_BIT_ORDER_POS))
#define MJENC_REG_ORDER_U_EVEN                                  MJENC_REG_ORDER_U_EVEN
#define MJENC_REG_ORDER_U_EVEN_POS                              (2U)
#define MJENC_REG_ORDER_U_EVEN_LEN                              (1U)
#define MJENC_REG_ORDER_U_EVEN_MSK                              (((1U<<MJENC_REG_ORDER_U_EVEN_LEN)-1)<<MJENC_REG_ORDER_U_EVEN_POS)
#define MJENC_REG_ORDER_U_EVEN_UMSK                             (~(((1U<<MJENC_REG_ORDER_U_EVEN_LEN)-1)<<MJENC_REG_ORDER_U_EVEN_POS))
#define MJENC_REG_Q_MODE                                        MJENC_REG_Q_MODE
#define MJENC_REG_Q_MODE_POS                                    (4U)
#define MJENC_REG_Q_MODE_LEN                                    (3U)
#define MJENC_REG_Q_MODE_MSK                                    (((1U<<MJENC_REG_Q_MODE_LEN)-1)<<MJENC_REG_Q_MODE_POS)
#define MJENC_REG_Q_MODE_UMSK                                   (~(((1U<<MJENC_REG_Q_MODE_LEN)-1)<<MJENC_REG_Q_MODE_POS))
#define MJENC_REG_W_XLEN                                        MJENC_REG_W_XLEN
#define MJENC_REG_W_XLEN_POS                                    (8U)
#define MJENC_REG_W_XLEN_LEN                                    (3U)
#define MJENC_REG_W_XLEN_MSK                                    (((1U<<MJENC_REG_W_XLEN_LEN)-1)<<MJENC_REG_W_XLEN_POS)
#define MJENC_REG_W_XLEN_UMSK                                   (~(((1U<<MJENC_REG_W_XLEN_LEN)-1)<<MJENC_REG_W_XLEN_POS))
#define MJENC_REG_LAST_HF_HBLK_DMY                               MJENC_REG_LAST_HF_HBLK_DMY
#define MJENC_REG_LAST_HF_HBLK_DMY_POS                           (11U)
#define MJENC_REG_LAST_HF_HBLK_DMY_LEN                           (1U)
#define MJENC_REG_LAST_HF_HBLK_DMY_MSK                           (((1U<<MJENC_REG_LAST_HF_HBLK_DMY_LEN)-1)<<MJENC_REG_LAST_HF_HBLK_DMY_POS)
#define MJENC_REG_LAST_HF_HBLK_DMY_UMSK                          (~(((1U<<MJENC_REG_LAST_HF_HBLK_DMY_LEN)-1)<<MJENC_REG_LAST_HF_HBLK_DMY_POS))
#define MJENC_REG_FRAME_WBLK                                    MJENC_REG_FRAME_WBLK
#define MJENC_REG_FRAME_WBLK_POS                                (16U)
#define MJENC_REG_FRAME_WBLK_LEN                                (8U)
#define MJENC_REG_FRAME_WBLK_MSK                                (((1U<<MJENC_REG_FRAME_WBLK_LEN)-1)<<MJENC_REG_FRAME_WBLK_POS)
#define MJENC_REG_FRAME_WBLK_UMSK                               (~(((1U<<MJENC_REG_FRAME_WBLK_LEN)-1)<<MJENC_REG_FRAME_WBLK_POS))
#define MJENC_REG_FRAME_HBLK                                    MJENC_REG_FRAME_HBLK
#define MJENC_REG_FRAME_HBLK_POS                                (24U)
#define MJENC_REG_FRAME_HBLK_LEN                                (8U)
#define MJENC_REG_FRAME_HBLK_MSK                                (((1U<<MJENC_REG_FRAME_HBLK_LEN)-1)<<MJENC_REG_FRAME_HBLK_POS)
#define MJENC_REG_FRAME_HBLK_UMSK                               (~(((1U<<MJENC_REG_FRAME_HBLK_LEN)-1)<<MJENC_REG_FRAME_HBLK_POS))

/* 0x4 : mjpeg_control_2 */
#define MJENC_MJPEG_CONTROL_2_OFFSET                            (0x4)
#define MJENC_REG_SW_FRAME                                      MJENC_REG_SW_FRAME
#define MJENC_REG_SW_FRAME_POS                                  (0U)
#define MJENC_REG_SW_FRAME_LEN                                  (5U)
#define MJENC_REG_SW_FRAME_MSK                                  (((1U<<MJENC_REG_SW_FRAME_LEN)-1)<<MJENC_REG_SW_FRAME_POS)
#define MJENC_REG_SW_FRAME_UMSK                                 (~(((1U<<MJENC_REG_SW_FRAME_LEN)-1)<<MJENC_REG_SW_FRAME_POS))
#define MJENC_REG_MJPEG_SW_MODE                                 MJENC_REG_MJPEG_SW_MODE
#define MJENC_REG_MJPEG_SW_MODE_POS                             (8U)
#define MJENC_REG_MJPEG_SW_MODE_LEN                             (1U)
#define MJENC_REG_MJPEG_SW_MODE_MSK                             (((1U<<MJENC_REG_MJPEG_SW_MODE_LEN)-1)<<MJENC_REG_MJPEG_SW_MODE_POS)
#define MJENC_REG_MJPEG_SW_MODE_UMSK                            (~(((1U<<MJENC_REG_MJPEG_SW_MODE_LEN)-1)<<MJENC_REG_MJPEG_SW_MODE_POS))
#define MJENC_REG_MJPEG_SW_RUN                                  MJENC_REG_MJPEG_SW_RUN
#define MJENC_REG_MJPEG_SW_RUN_POS                              (9U)
#define MJENC_REG_MJPEG_SW_RUN_LEN                              (1U)
#define MJENC_REG_MJPEG_SW_RUN_MSK                              (((1U<<MJENC_REG_MJPEG_SW_RUN_LEN)-1)<<MJENC_REG_MJPEG_SW_RUN_POS)
#define MJENC_REG_MJPEG_SW_RUN_UMSK                             (~(((1U<<MJENC_REG_MJPEG_SW_RUN_LEN)-1)<<MJENC_REG_MJPEG_SW_RUN_POS))
#define MJENC_REG_YY_DVP2AXI_SEL                                MJENC_REG_YY_DVP2AXI_SEL
#define MJENC_REG_YY_DVP2AXI_SEL_POS                            (12U)
#define MJENC_REG_YY_DVP2AXI_SEL_LEN                            (2U)
#define MJENC_REG_YY_DVP2AXI_SEL_MSK                            (((1U<<MJENC_REG_YY_DVP2AXI_SEL_LEN)-1)<<MJENC_REG_YY_DVP2AXI_SEL_POS)
#define MJENC_REG_YY_DVP2AXI_SEL_UMSK                           (~(((1U<<MJENC_REG_YY_DVP2AXI_SEL_LEN)-1)<<MJENC_REG_YY_DVP2AXI_SEL_POS))
#define MJENC_REG_UV_DVP2AXI_SEL                                MJENC_REG_UV_DVP2AXI_SEL
#define MJENC_REG_UV_DVP2AXI_SEL_POS                            (14U)
#define MJENC_REG_UV_DVP2AXI_SEL_LEN                            (2U)
#define MJENC_REG_UV_DVP2AXI_SEL_MSK                            (((1U<<MJENC_REG_UV_DVP2AXI_SEL_LEN)-1)<<MJENC_REG_UV_DVP2AXI_SEL_POS)
#define MJENC_REG_UV_DVP2AXI_SEL_UMSK                           (~(((1U<<MJENC_REG_UV_DVP2AXI_SEL_LEN)-1)<<MJENC_REG_UV_DVP2AXI_SEL_POS))
#define MJENC_REG_MJPEG_WAIT_CYCLE                              MJENC_REG_MJPEG_WAIT_CYCLE
#define MJENC_REG_MJPEG_WAIT_CYCLE_POS                          (16U)
#define MJENC_REG_MJPEG_WAIT_CYCLE_LEN                          (16U)
#define MJENC_REG_MJPEG_WAIT_CYCLE_MSK                          (((1U<<MJENC_REG_MJPEG_WAIT_CYCLE_LEN)-1)<<MJENC_REG_MJPEG_WAIT_CYCLE_POS)
#define MJENC_REG_MJPEG_WAIT_CYCLE_UMSK                         (~(((1U<<MJENC_REG_MJPEG_WAIT_CYCLE_LEN)-1)<<MJENC_REG_MJPEG_WAIT_CYCLE_POS))

/* 0x08 : mjpeg_yy_frame_addr */
#define MJENC_MJPEG_YY_FRAME_ADDR_OFFSET                        (0x08)
#define MJENC_REG_YY_ADDR_START                                 MJENC_REG_YY_ADDR_START
#define MJENC_REG_YY_ADDR_START_POS                             (0U)
#define MJENC_REG_YY_ADDR_START_LEN                             (32U)
#define MJENC_REG_YY_ADDR_START_MSK                             (((1U<<MJENC_REG_YY_ADDR_START_LEN)-1)<<MJENC_REG_YY_ADDR_START_POS)
#define MJENC_REG_YY_ADDR_START_UMSK                            (~(((1U<<MJENC_REG_YY_ADDR_START_LEN)-1)<<MJENC_REG_YY_ADDR_START_POS))

