sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/mm_reg/mjpeg_reg_a0.h
/* 0x0C : mjpeg_uv_frame_addr */
#define MJENC_MJPEG_UV_FRAME_ADDR_OFFSET                        (0x0C)
#define MJENC_REG_UV_ADDR_START                                 MJENC_REG_UV_ADDR_START
#define MJENC_REG_UV_ADDR_START_POS                             (0U)
#define MJENC_REG_UV_ADDR_START_LEN                             (32U)
#define MJENC_REG_UV_ADDR_START_MSK                             (((1U<<MJENC_REG_UV_ADDR_START_LEN)-1)<<MJENC_REG_UV_ADDR_START_POS)
#define MJENC_REG_UV_ADDR_START_UMSK                            (~(((1U<<MJENC_REG_UV_ADDR_START_LEN)-1)<<MJENC_REG_UV_ADDR_START_POS))

/* 0x10 : mjpeg_yuv_mem */
#define MJENC_MJPEG_YUV_MEM_OFFSET                              (0x10)
#define MJENC_REG_YY_MEM_HBLK                                   MJENC_REG_YY_MEM_HBLK
#define MJENC_REG_YY_MEM_HBLK_POS                               (0U)
#define MJENC_REG_YY_MEM_HBLK_LEN                               (13U)
#define MJENC_REG_YY_MEM_HBLK_MSK                               (((1U<<MJENC_REG_YY_MEM_HBLK_LEN)-1)<<MJENC_REG_YY_MEM_HBLK_POS)
#define MJENC_REG_YY_MEM_HBLK_UMSK                              (~(((1U<<MJENC_REG_YY_MEM_HBLK_LEN)-1)<<MJENC_REG_YY_MEM_HBLK_POS))
#define MJENC_REG_UV_MEM_HBLK                                   MJENC_REG_UV_MEM_HBLK
#define MJENC_REG_UV_MEM_HBLK_POS                               (16U)
#define MJENC_REG_UV_MEM_HBLK_LEN                               (13U)
#define MJENC_REG_UV_MEM_HBLK_MSK                               (((1U<<MJENC_REG_UV_MEM_HBLK_LEN)-1)<<MJENC_REG_UV_MEM_HBLK_POS)
#define MJENC_REG_UV_MEM_HBLK_UMSK                              (~(((1U<<MJENC_REG_UV_MEM_HBLK_LEN)-1)<<MJENC_REG_UV_MEM_HBLK_POS))

/* 0x14 : jpeg_frame_addr */
#define MJENC_JPEG_FRAME_ADDR_OFFSET                            (0x14)
#define MJENC_REG_W_ADDR_START                                  MJENC_REG_W_ADDR_START
#define MJENC_REG_W_ADDR_START_POS                              (0U)
#define MJENC_REG_W_ADDR_START_LEN                              (32U)
#define MJENC_REG_W_ADDR_START_MSK                              (((1U<<MJENC_REG_W_ADDR_START_LEN)-1)<<MJENC_REG_W_ADDR_START_POS)
#define MJENC_REG_W_ADDR_START_UMSK                             (~(((1U<<MJENC_REG_W_ADDR_START_LEN)-1)<<MJENC_REG_W_ADDR_START_POS))

/* 0x18 : jpeg_store_memory */
#define MJENC_JPEG_STORE_MEMORY_OFFSET                          (0x18)
#define MJENC_REG_W_BURST_CNT                                   MJENC_REG_W_BURST_CNT
#define MJENC_REG_W_BURST_CNT_POS                               (0U)
#define MJENC_REG_W_BURST_CNT_LEN                               (32U)
#define MJENC_REG_W_BURST_CNT_MSK                               (((1U<<MJENC_REG_W_BURST_CNT_LEN)-1)<<MJENC_REG_W_BURST_CNT_POS)
#define MJENC_REG_W_BURST_CNT_UMSK                              (~(((1U<<MJENC_REG_W_BURST_CNT_LEN)-1)<<MJENC_REG_W_BURST_CNT_POS))

/* 0x1C : mjpeg_control_3 */
#define MJENC_MJPEG_CONTROL_3_OFFSET                                  (0x1C)
#define MJENC_REG_INT_NORMAL_EN                                 MJENC_REG_INT_NORMAL_EN
#define MJENC_REG_INT_NORMAL_EN_POS                             (0U)
#define MJENC_REG_INT_NORMAL_EN_LEN                             (1U)
#define MJENC_REG_INT_NORMAL_EN_MSK                             (((1U<<MJENC_REG_INT_NORMAL_EN_LEN)-1)<<MJENC_REG_INT_NORMAL_EN_POS)
#define MJENC_REG_INT_NORMAL_EN_UMSK                            (~(((1U<<MJENC_REG_INT_NORMAL_EN_LEN)-1)<<MJENC_REG_INT_NORMAL_EN_POS))
#define MJENC_REG_INT_CAM_EN                                    MJENC_REG_INT_CAM_EN
#define MJENC_REG_INT_CAM_EN_POS                                (1U)
#define MJENC_REG_INT_CAM_EN_LEN                                (1U)
#define MJENC_REG_INT_CAM_EN_MSK                                (((1U<<MJENC_REG_INT_CAM_EN_LEN)-1)<<MJENC_REG_INT_CAM_EN_POS)
#define MJENC_REG_INT_CAM_EN_UMSK                               (~(((1U<<MJENC_REG_INT_CAM_EN_LEN)-1)<<MJENC_REG_INT_CAM_EN_POS))
#define MJENC_REG_INT_MEM_EN                                    MJENC_REG_INT_MEM_EN
#define MJENC_REG_INT_MEM_EN_POS                                (2U)
#define MJENC_REG_INT_MEM_EN_LEN                                (1U)
#define MJENC_REG_INT_MEM_EN_MSK                                (((1U<<MJENC_REG_INT_MEM_EN_LEN)-1)<<MJENC_REG_INT_MEM_EN_POS)
#define MJENC_REG_INT_MEM_EN_UMSK                               (~(((1U<<MJENC_REG_INT_MEM_EN_LEN)-1)<<MJENC_REG_INT_MEM_EN_POS))
#define MJENC_REG_INT_FRAME_EN                                  MJENC_REG_INT_FRAME_EN
#define MJENC_REG_INT_FRAME_EN_POS                              (3U)
#define MJENC_REG_INT_FRAME_EN_LEN                              (1U)
#define MJENC_REG_INT_FRAME_EN_MSK                              (((1U<<MJENC_REG_INT_FRAME_EN_LEN)-1)<<MJENC_REG_INT_FRAME_EN_POS)
#define MJENC_REG_INT_FRAME_EN_UMSK                             (~(((1U<<MJENC_REG_INT_FRAME_EN_LEN)-1)<<MJENC_REG_INT_FRAME_EN_POS))
#define MJENC_STS_NORMAL_INT                                    MJENC_STS_NORMAL_INT
#define MJENC_STS_NORMAL_INT_POS                                (4U)
#define MJENC_STS_NORMAL_INT_LEN                                (1U)
#define MJENC_STS_NORMAL_INT_MSK                                (((1U<<MJENC_STS_NORMAL_INT_LEN)-1)<<MJENC_STS_NORMAL_INT_POS)
#define MJENC_STS_NORMAL_INT_UMSK                               (~(((1U<<MJENC_STS_NORMAL_INT_LEN)-1)<<MJENC_STS_NORMAL_INT_POS))
#define MJENC_STS_CAM_INT                                       MJENC_STS_CAM_INT
#define MJENC_STS_CAM_INT_POS                                   (5U)
#define MJENC_STS_CAM_INT_LEN                                   (1U)
#define MJENC_STS_CAM_INT_MSK                                   (((1U<<MJENC_STS_CAM_INT_LEN)-1)<<MJENC_STS_CAM_INT_POS)
#define MJENC_STS_CAM_INT_UMSK                                  (~(((1U<<MJENC_STS_CAM_INT_LEN)-1)<<MJENC_STS_CAM_INT_POS))
#define MJENC_STS_MEM_INT                                       MJENC_STS_MEM_INT
#define MJENC_STS_MEM_INT_POS                                   (6U)
#define MJENC_STS_MEM_INT_LEN                                   (1U)
#define MJENC_STS_MEM_INT_MSK                                   (((1U<<MJENC_STS_MEM_INT_LEN)-1)<<MJENC_STS_MEM_INT_POS)
#define MJENC_STS_MEM_INT_UMSK                                  (~(((1U<<MJENC_STS_MEM_INT_LEN)-1)<<MJENC_STS_MEM_INT_POS))
#define MJENC_STS_FRAME_INT                                     MJENC_STS_FRAME_INT
#define MJENC_STS_FRAME_INT_POS                                 (7U)
#define MJENC_STS_FRAME_INT_LEN                                 (1U)
#define MJENC_STS_FRAME_INT_MSK                                 (((1U<<MJENC_STS_FRAME_INT_LEN)-1)<<MJENC_STS_FRAME_INT_POS)
#define MJENC_STS_FRAME_INT_UMSK                                (~(((1U<<MJENC_STS_FRAME_INT_LEN)-1)<<MJENC_STS_FRAME_INT_POS))
#define MJENC_MJPEG_IDLE                                        MJENC_MJPEG_IDLE
#define MJENC_MJPEG_IDLE_POS                                    (8U)
#define MJENC_MJPEG_IDLE_LEN                                    (1U)
#define MJENC_MJPEG_IDLE_MSK                                    (((1U<<MJENC_MJPEG_IDLE_LEN)-1)<<MJENC_MJPEG_IDLE_POS)
#define MJENC_MJPEG_IDLE_UMSK                                   (~(((1U<<MJENC_MJPEG_IDLE_LEN)-1)<<MJENC_MJPEG_IDLE_POS))
#define MJENC_MJPEG_FUNC                                        MJENC_MJPEG_FUNC
#define MJENC_MJPEG_FUNC_POS                                    (9U)
#define MJENC_MJPEG_FUNC_LEN                                    (1U)
#define MJENC_MJPEG_FUNC_MSK                                    (((1U<<MJENC_MJPEG_FUNC_LEN)-1)<<MJENC_MJPEG_FUNC_POS)
#define MJENC_MJPEG_FUNC_UMSK                                   (~(((1U<<MJENC_MJPEG_FUNC_LEN)-1)<<MJENC_MJPEG_FUNC_POS))
#define MJENC_MJPEG_WAIT                                        MJENC_MJPEG_WAIT
#define MJENC_MJPEG_WAIT_POS                                    (10U)
#define MJENC_MJPEG_WAIT_LEN                                    (1U)
#define MJENC_MJPEG_WAIT_MSK                                    (((1U<<MJENC_MJPEG_WAIT_LEN)-1)<<MJENC_MJPEG_WAIT_POS)
#define MJENC_MJPEG_WAIT_UMSK                                   (~(((1U<<MJENC_MJPEG_WAIT_LEN)-1)<<MJENC_MJPEG_WAIT_POS))
#define MJENC_MJPEG_FLSH                                        MJENC_MJPEG_FLSH
#define MJENC_MJPEG_FLSH_POS                                    (11U)
#define MJENC_MJPEG_FLSH_LEN                                    (1U)
#define MJENC_MJPEG_FLSH_MSK                                    (((1U<<MJENC_MJPEG_FLSH_LEN)-1)<<MJENC_MJPEG_FLSH_POS)
#define MJENC_MJPEG_FLSH_UMSK                                   (~(((1U<<MJENC_MJPEG_FLSH_LEN)-1)<<MJENC_MJPEG_FLSH_POS))
#define MJENC_MJPEG_MANS                                        MJENC_MJPEG_MANS
#define MJENC_MJPEG_MANS_POS                                    (12U)
#define MJENC_MJPEG_MANS_LEN                                    (1U)
#define MJENC_MJPEG_MANS_MSK                                    (((1U<<MJENC_MJPEG_MANS_LEN)-1)<<MJENC_MJPEG_MANS_POS)
#define MJENC_MJPEG_MANS_UMSK                                   (~(((1U<<MJENC_MJPEG_MANS_LEN)-1)<<MJENC_MJPEG_MANS_POS))
#define MJENC_MJPEG_MANF                                        MJENC_MJPEG_MANF
#define MJENC_MJPEG_MANF_POS                                    (13U)
#define MJENC_MJPEG_MANF_LEN                                    (1U)
#define MJENC_MJPEG_MANF_MSK                                    (((1U<<MJENC_MJPEG_MANF_LEN)-1)<<MJENC_MJPEG_MANF_POS)
#define MJENC_MJPEG_MANF_UMSK                                   (~(((1U<<MJENC_MJPEG_MANF_LEN)-1)<<MJENC_MJPEG_MANF_POS))
#define MJENC_AXI_READ_IDLE                                     MJENC_AXI_READ_IDLE
#define MJENC_AXI_READ_IDLE_POS                                 (14U)
#define MJENC_AXI_READ_IDLE_LEN                                 (1U)
#define MJENC_AXI_READ_IDLE_MSK                                 (((1U<<MJENC_AXI_READ_IDLE_LEN)-1)<<MJENC_AXI_READ_IDLE_POS)
#define MJENC_AXI_READ_IDLE_UMSK                                (~(((1U<<MJENC_AXI_READ_IDLE_LEN)-1)<<MJENC_AXI_READ_IDLE_POS))
#define MJENC_AXI_WRITE_IDLE                                    MJENC_AXI_WRITE_IDLE
#define MJENC_AXI_WRITE_IDLE_POS                                (15U)
#define MJENC_AXI_WRITE_IDLE_LEN                                (1U)
#define MJENC_AXI_WRITE_IDLE_MSK                                (((1U<<MJENC_AXI_WRITE_IDLE_LEN)-1)<<MJENC_AXI_WRITE_IDLE_POS)
#define MJENC_AXI_WRITE_IDLE_UMSK                               (~(((1U<<MJENC_AXI_WRITE_IDLE_LEN)-1)<<MJENC_AXI_WRITE_IDLE_POS))
#define MJENC_REG_FRAME_CNT_TRGR_INT                            MJENC_REG_FRAME_CNT_TRGR_INT
#define MJENC_REG_FRAME_CNT_TRGR_INT_POS                        (16U)
#define MJENC_REG_FRAME_CNT_TRGR_INT_LEN                        (5U)
#define MJENC_REG_FRAME_CNT_TRGR_INT_MSK                        (((1U<<MJENC_REG_FRAME_CNT_TRGR_INT_LEN)-1)<<MJENC_REG_FRAME_CNT_TRGR_INT_POS)
#define MJENC_REG_FRAME_CNT_TRGR_INT_UMSK                       (~(((1U<<MJENC_REG_FRAME_CNT_TRGR_INT_LEN)-1)<<MJENC_REG_FRAME_CNT_TRGR_INT_POS))
#define MJENC_REG_INT_IDLE_EN                                   MJENC_REG_INT_IDLE_EN
#define MJENC_REG_INT_IDLE_EN_POS                               (21U)
#define MJENC_REG_INT_IDLE_EN_LEN                               (1U)
#define MJENC_REG_INT_IDLE_EN_MSK                               (((1U<<MJENC_REG_INT_IDLE_EN_LEN)-1)<<MJENC_REG_INT_IDLE_EN_POS)
#define MJENC_REG_INT_IDLE_EN_UMSK                              (~(((1U<<MJENC_REG_INT_IDLE_EN_LEN)-1)<<MJENC_REG_INT_IDLE_EN_POS))
#define MJENC_STS_IDLE_INT                                      MJENC_STS_IDLE_INT
#define MJENC_STS_IDLE_INT_POS                                  (22U)
#define MJENC_STS_IDLE_INT_LEN                                  (1U)
#define MJENC_STS_IDLE_INT_MSK                                  (((1U<<MJENC_STS_IDLE_INT_LEN)-1)<<MJENC_STS_IDLE_INT_POS)
#define MJENC_STS_IDLE_INT_UMSK                                 (~(((1U<<MJENC_STS_IDLE_INT_LEN)-1)<<MJENC_STS_IDLE_INT_POS))
#define MJENC_FRAME_VALID_CNT                                   MJENC_FRAME_VALID_CNT
#define MJENC_FRAME_VALID_CNT_POS                               (24U)
#define MJENC_FRAME_VALID_CNT_LEN                               (5U)
#define MJENC_FRAME_VALID_CNT_MSK                               (((1U<<MJENC_FRAME_VALID_CNT_LEN)-1)<<MJENC_FRAME_VALID_CNT_POS)
#define MJENC_FRAME_VALID_CNT_UMSK                              (~(((1U<<MJENC_FRAME_VALID_CNT_LEN)-1)<<MJENC_FRAME_VALID_CNT_POS))

/* 0x20 : mjpeg_frame_fifo_pop */
#define MJENC_MJPEG_FRAME_FIFO_POP_OFFSET                       (0x20)
#define MJENC_RFIFO_POP                                         MJENC_RFIFO_POP
#define MJENC_RFIFO_POP_POS                                     (0U)
#define MJENC_RFIFO_POP_LEN                                     (1U)
#define MJENC_RFIFO_POP_MSK                                     (((1U<<MJENC_RFIFO_POP_LEN)-1)<<MJENC_RFIFO_POP_POS)
#define MJENC_RFIFO_POP_UMSK                                    (~(((1U<<MJENC_RFIFO_POP_LEN)-1)<<MJENC_RFIFO_POP_POS))
#define MJENC_REG_INT_CLR                                       MJENC_REG_INT_CLR
#define MJENC_REG_INT_CLR_POS                                   (8U)
#define MJENC_REG_INT_CLR_LEN                                   (1U)
#define MJENC_REG_INT_CLR_MSK                                   (((1U<<MJENC_REG_INT_CLR_LEN)-1)<<MJENC_REG_INT_CLR_POS)
#define MJENC_REG_INT_CLR_UMSK                                  (~(((1U<<MJENC_REG_INT_CLR_LEN)-1)<<MJENC_REG_INT_CLR_POS))

/* 0x40 : mjpeg_Y_frame_read_status_1 */
#define MJENC_MJPEG_Y_FRAME_READ_STATUS_1_OFFSET                (0x40)
#define MJENC_YY_MEM_HBLK_R                                     MJENC_YY_MEM_HBLK_R
#define MJENC_YY_MEM_HBLK_R_POS                                 (0U)
#define MJENC_YY_MEM_HBLK_R_LEN                                 (13U)
#define MJENC_YY_MEM_HBLK_R_MSK                                 (((1U<<MJENC_YY_MEM_HBLK_R_LEN)-1)<<MJENC_YY_MEM_HBLK_R_POS)
#define MJENC_YY_MEM_HBLK_R_UMSK                                (~(((1U<<MJENC_YY_MEM_HBLK_R_LEN)-1)<<MJENC_YY_MEM_HBLK_R_POS))
#define MJENC_YY_FRM_HBLK_R                                     MJENC_YY_FRM_HBLK_R
#define MJENC_YY_FRM_HBLK_R_POS                                 (16U)
#define MJENC_YY_FRM_HBLK_R_LEN                                 (13U)
#define MJENC_YY_FRM_HBLK_R_MSK                                 (((1U<<MJENC_YY_FRM_HBLK_R_LEN)-1)<<MJENC_YY_FRM_HBLK_R_POS)
#define MJENC_YY_FRM_HBLK_R_UMSK                                (~(((1U<<MJENC_YY_FRM_HBLK_R_LEN)-1)<<MJENC_YY_FRM_HBLK_R_POS))

