sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/mm_reg/mjpeg_reg_a0.h
/* 0x44 : mjpeg_Y_frame_read_status_2 */
#define MJENC_MJPEG_Y_FRAME_READ_STATUS_2_OFFSET                (0x44)
#define MJENC_YY_WBLK_R                                         MJENC_YY_WBLK_R
#define MJENC_YY_WBLK_R_POS                                     (0U)
#define MJENC_YY_WBLK_R_LEN                                     (13U)
#define MJENC_YY_WBLK_R_MSK                                     (((1U<<MJENC_YY_WBLK_R_LEN)-1)<<MJENC_YY_WBLK_R_POS)
#define MJENC_YY_WBLK_R_UMSK                                    (~(((1U<<MJENC_YY_WBLK_R_LEN)-1)<<MJENC_YY_WBLK_R_POS))
#define MJENC_YY_MEM_RND_R                                      MJENC_YY_MEM_RND_R
#define MJENC_YY_MEM_RND_R_POS                                  (16U)
#define MJENC_YY_MEM_RND_R_LEN                                  (8U)
#define MJENC_YY_MEM_RND_R_MSK                                  (((1U<<MJENC_YY_MEM_RND_R_LEN)-1)<<MJENC_YY_MEM_RND_R_POS)
#define MJENC_YY_MEM_RND_R_UMSK                                 (~(((1U<<MJENC_YY_MEM_RND_R_LEN)-1)<<MJENC_YY_MEM_RND_R_POS))
#define MJENC_YY_FRM_CNT_R                                      MJENC_YY_FRM_CNT_R
#define MJENC_YY_FRM_CNT_R_POS                                  (24U)
#define MJENC_YY_FRM_CNT_R_LEN                                  (8U)
#define MJENC_YY_FRM_CNT_R_MSK                                  (((1U<<MJENC_YY_FRM_CNT_R_LEN)-1)<<MJENC_YY_FRM_CNT_R_POS)
#define MJENC_YY_FRM_CNT_R_UMSK                                 (~(((1U<<MJENC_YY_FRM_CNT_R_LEN)-1)<<MJENC_YY_FRM_CNT_R_POS))

/* 0x48 : mjpeg_Y_frame_write_status */
#define MJENC_MJPEG_Y_FRAME_WRITE_STATUS_OFFSET                 (0x48)
#define MJENC_YY_MEM_HBLK_W                                     MJENC_YY_MEM_HBLK_W
#define MJENC_YY_MEM_HBLK_W_POS                                 (0U)
#define MJENC_YY_MEM_HBLK_W_LEN                                 (13U)
#define MJENC_YY_MEM_HBLK_W_MSK                                 (((1U<<MJENC_YY_MEM_HBLK_W_LEN)-1)<<MJENC_YY_MEM_HBLK_W_POS)
#define MJENC_YY_MEM_HBLK_W_UMSK                                (~(((1U<<MJENC_YY_MEM_HBLK_W_LEN)-1)<<MJENC_YY_MEM_HBLK_W_POS))
#define MJENC_YY_MEM_RND_W                                      MJENC_YY_MEM_RND_W
#define MJENC_YY_MEM_RND_W_POS                                  (16U)
#define MJENC_YY_MEM_RND_W_LEN                                  (8U)
#define MJENC_YY_MEM_RND_W_MSK                                  (((1U<<MJENC_YY_MEM_RND_W_LEN)-1)<<MJENC_YY_MEM_RND_W_POS)
#define MJENC_YY_MEM_RND_W_UMSK                                 (~(((1U<<MJENC_YY_MEM_RND_W_LEN)-1)<<MJENC_YY_MEM_RND_W_POS))
#define MJENC_YY_FRM_CNT_W                                      MJENC_YY_FRM_CNT_W
#define MJENC_YY_FRM_CNT_W_POS                                  (24U)
#define MJENC_YY_FRM_CNT_W_LEN                                  (8U)
#define MJENC_YY_FRM_CNT_W_MSK                                  (((1U<<MJENC_YY_FRM_CNT_W_LEN)-1)<<MJENC_YY_FRM_CNT_W_POS)
#define MJENC_YY_FRM_CNT_W_UMSK                                 (~(((1U<<MJENC_YY_FRM_CNT_W_LEN)-1)<<MJENC_YY_FRM_CNT_W_POS))

/* 0x4C : mjpeg_UV_frame_read_status_1 */
#define MJENC_MJPEG_UV_FRAME_READ_STATUS_1_OFFSET               (0x4C)
#define MJENC_UV_MEM_HBLK_R                                     MJENC_UV_MEM_HBLK_R
#define MJENC_UV_MEM_HBLK_R_POS                                 (0U)
#define MJENC_UV_MEM_HBLK_R_LEN                                 (13U)
#define MJENC_UV_MEM_HBLK_R_MSK                                 (((1U<<MJENC_UV_MEM_HBLK_R_LEN)-1)<<MJENC_UV_MEM_HBLK_R_POS)
#define MJENC_UV_MEM_HBLK_R_UMSK                                (~(((1U<<MJENC_UV_MEM_HBLK_R_LEN)-1)<<MJENC_UV_MEM_HBLK_R_POS))
#define MJENC_UV_FRM_HBLK_R                                     MJENC_UV_FRM_HBLK_R
#define MJENC_UV_FRM_HBLK_R_POS                                 (16U)
#define MJENC_UV_FRM_HBLK_R_LEN                                 (13U)
#define MJENC_UV_FRM_HBLK_R_MSK                                 (((1U<<MJENC_UV_FRM_HBLK_R_LEN)-1)<<MJENC_UV_FRM_HBLK_R_POS)
#define MJENC_UV_FRM_HBLK_R_UMSK                                (~(((1U<<MJENC_UV_FRM_HBLK_R_LEN)-1)<<MJENC_UV_FRM_HBLK_R_POS))

/* 0x50 : mjpeg_UV_frame_read_status_2 */
#define MJENC_MJPEG_UV_FRAME_READ_STATUS_2_OFFSET               (0x50)
#define MJENC_UV_WBLK_R                                         MJENC_UV_WBLK_R
#define MJENC_UV_WBLK_R_POS                                     (0U)
#define MJENC_UV_WBLK_R_LEN                                     (13U)
#define MJENC_UV_WBLK_R_MSK                                     (((1U<<MJENC_UV_WBLK_R_LEN)-1)<<MJENC_UV_WBLK_R_POS)
#define MJENC_UV_WBLK_R_UMSK                                    (~(((1U<<MJENC_UV_WBLK_R_LEN)-1)<<MJENC_UV_WBLK_R_POS))
#define MJENC_UV_MEM_RND_R                                      MJENC_UV_MEM_RND_R
#define MJENC_UV_MEM_RND_R_POS                                  (16U)
#define MJENC_UV_MEM_RND_R_LEN                                  (8U)
#define MJENC_UV_MEM_RND_R_MSK                                  (((1U<<MJENC_UV_MEM_RND_R_LEN)-1)<<MJENC_UV_MEM_RND_R_POS)
#define MJENC_UV_MEM_RND_R_UMSK                                 (~(((1U<<MJENC_UV_MEM_RND_R_LEN)-1)<<MJENC_UV_MEM_RND_R_POS))
#define MJENC_UV_FRM_CNT_R                                      MJENC_UV_FRM_CNT_R
#define MJENC_UV_FRM_CNT_R_POS                                  (24U)
#define MJENC_UV_FRM_CNT_R_LEN                                  (8U)
#define MJENC_UV_FRM_CNT_R_MSK                                  (((1U<<MJENC_UV_FRM_CNT_R_LEN)-1)<<MJENC_UV_FRM_CNT_R_POS)
#define MJENC_UV_FRM_CNT_R_UMSK                                 (~(((1U<<MJENC_UV_FRM_CNT_R_LEN)-1)<<MJENC_UV_FRM_CNT_R_POS))

/* 0x54 : mjpeg_UV_frame_write_status */
#define MJENC_MJPEG_UV_FRAME_WRITE_STATUS_OFFSET                (0x54)
#define MJENC_UV_MEM_HBLK_W                                     MJENC_UV_MEM_HBLK_W
#define MJENC_UV_MEM_HBLK_W_POS                                 (0U)
#define MJENC_UV_MEM_HBLK_W_LEN                                 (13U)
#define MJENC_UV_MEM_HBLK_W_MSK                                 (((1U<<MJENC_UV_MEM_HBLK_W_LEN)-1)<<MJENC_UV_MEM_HBLK_W_POS)
#define MJENC_UV_MEM_HBLK_W_UMSK                                (~(((1U<<MJENC_UV_MEM_HBLK_W_LEN)-1)<<MJENC_UV_MEM_HBLK_W_POS))
#define MJENC_UV_MEM_RND_W                                      MJENC_UV_MEM_RND_W
#define MJENC_UV_MEM_RND_W_POS                                  (16U)
#define MJENC_UV_MEM_RND_W_LEN                                  (8U)
#define MJENC_UV_MEM_RND_W_MSK                                  (((1U<<MJENC_UV_MEM_RND_W_LEN)-1)<<MJENC_UV_MEM_RND_W_POS)
#define MJENC_UV_MEM_RND_W_UMSK                                 (~(((1U<<MJENC_UV_MEM_RND_W_LEN)-1)<<MJENC_UV_MEM_RND_W_POS))
#define MJENC_UV_FRM_CNT_W                                      MJENC_UV_FRM_CNT_W
#define MJENC_UV_FRM_CNT_W_POS                                  (24U)
#define MJENC_UV_FRM_CNT_W_LEN                                  (8U)
#define MJENC_UV_FRM_CNT_W_MSK                                  (((1U<<MJENC_UV_FRM_CNT_W_LEN)-1)<<MJENC_UV_FRM_CNT_W_POS)
#define MJENC_UV_FRM_CNT_W_UMSK                                 (~(((1U<<MJENC_UV_FRM_CNT_W_LEN)-1)<<MJENC_UV_FRM_CNT_W_POS))

/* 0x80 : mjpeg_start_addr0 */
#define MJENC_MJPEG_START_ADDR0_OFFSET                          (0x80)
#define MJENC_FRAME_START_ADDR_0                                MJENC_FRAME_START_ADDR_0
#define MJENC_FRAME_START_ADDR_0_POS                            (0U)
#define MJENC_FRAME_START_ADDR_0_LEN                            (32U)
#define MJENC_FRAME_START_ADDR_0_MSK                            (((1U<<MJENC_FRAME_START_ADDR_0_LEN)-1)<<MJENC_FRAME_START_ADDR_0_POS)
#define MJENC_FRAME_START_ADDR_0_UMSK                           (~(((1U<<MJENC_FRAME_START_ADDR_0_LEN)-1)<<MJENC_FRAME_START_ADDR_0_POS))

/* 0x84 : mjpeg_bit_cnt0 */
#define MJENC_MJPEG_BIT_CNT0_OFFSET                             (0x84)
#define MJENC_FRAME_BIT_CNT_0                                   MJENC_FRAME_BIT_CNT_0
#define MJENC_FRAME_BIT_CNT_0_POS                               (0U)
#define MJENC_FRAME_BIT_CNT_0_LEN                               (32U)
#define MJENC_FRAME_BIT_CNT_0_MSK                               (((1U<<MJENC_FRAME_BIT_CNT_0_LEN)-1)<<MJENC_FRAME_BIT_CNT_0_POS)
#define MJENC_FRAME_BIT_CNT_0_UMSK                              (~(((1U<<MJENC_FRAME_BIT_CNT_0_LEN)-1)<<MJENC_FRAME_BIT_CNT_0_POS))

