sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/mm_reg/mjpeg_reg_a0.h
/* 0x88 : mjpeg_start_addr1 */
#define MJENC_MJPEG_START_ADDR1_OFFSET                          (0x88)
#define MJENC_FRAME_START_ADDR_1                                MJENC_FRAME_START_ADDR_1
#define MJENC_FRAME_START_ADDR_1_POS                            (0U)
#define MJENC_FRAME_START_ADDR_1_LEN                            (32U)
#define MJENC_FRAME_START_ADDR_1_MSK                            (((1U<<MJENC_FRAME_START_ADDR_1_LEN)-1)<<MJENC_FRAME_START_ADDR_1_POS)
#define MJENC_FRAME_START_ADDR_1_UMSK                           (~(((1U<<MJENC_FRAME_START_ADDR_1_LEN)-1)<<MJENC_FRAME_START_ADDR_1_POS))

/* 0x8C : mjpeg_bit_cnt1 */
#define MJENC_MJPEG_BIT_CNT1_OFFSET                             (0x8C)
#define MJENC_FRAME_BIT_CNT_1                                   MJENC_FRAME_BIT_CNT_1
#define MJENC_FRAME_BIT_CNT_1_POS                               (0U)
#define MJENC_FRAME_BIT_CNT_1_LEN                               (32U)
#define MJENC_FRAME_BIT_CNT_1_MSK                               (((1U<<MJENC_FRAME_BIT_CNT_1_LEN)-1)<<MJENC_FRAME_BIT_CNT_1_POS)
#define MJENC_FRAME_BIT_CNT_1_UMSK                              (~(((1U<<MJENC_FRAME_BIT_CNT_1_LEN)-1)<<MJENC_FRAME_BIT_CNT_1_POS))

/* 0x90 : mjpeg_start_addr2 */
#define MJENC_MJPEG_START_ADDR2_OFFSET                          (0x90)
#define MJENC_FRAME_START_ADDR_2                                MJENC_FRAME_START_ADDR_2
#define MJENC_FRAME_START_ADDR_2_POS                            (0U)
#define MJENC_FRAME_START_ADDR_2_LEN                            (32U)
#define MJENC_FRAME_START_ADDR_2_MSK                            (((1U<<MJENC_FRAME_START_ADDR_2_LEN)-1)<<MJENC_FRAME_START_ADDR_2_POS)
#define MJENC_FRAME_START_ADDR_2_UMSK                           (~(((1U<<MJENC_FRAME_START_ADDR_2_LEN)-1)<<MJENC_FRAME_START_ADDR_2_POS))

/* 0x94 : mjpeg_bit_cnt2 */
#define MJENC_MJPEG_BIT_CNT2_OFFSET                             (0x94)
#define MJENC_FRAME_BIT_CNT_2                                   MJENC_FRAME_BIT_CNT_2
#define MJENC_FRAME_BIT_CNT_2_POS                               (0U)
#define MJENC_FRAME_BIT_CNT_2_LEN                               (32U)
#define MJENC_FRAME_BIT_CNT_2_MSK                               (((1U<<MJENC_FRAME_BIT_CNT_2_LEN)-1)<<MJENC_FRAME_BIT_CNT_2_POS)
#define MJENC_FRAME_BIT_CNT_2_UMSK                              (~(((1U<<MJENC_FRAME_BIT_CNT_2_LEN)-1)<<MJENC_FRAME_BIT_CNT_2_POS))

/* 0x98 : mjpeg_start_addr3 */
#define MJENC_MJPEG_START_ADDR3_OFFSET                          (0x98)
#define MJENC_FRAME_START_ADDR_3                                MJENC_FRAME_START_ADDR_3
#define MJENC_FRAME_START_ADDR_3_POS                            (0U)
#define MJENC_FRAME_START_ADDR_3_LEN                            (32U)
#define MJENC_FRAME_START_ADDR_3_MSK                            (((1U<<MJENC_FRAME_START_ADDR_3_LEN)-1)<<MJENC_FRAME_START_ADDR_3_POS)
#define MJENC_FRAME_START_ADDR_3_UMSK                           (~(((1U<<MJENC_FRAME_START_ADDR_3_LEN)-1)<<MJENC_FRAME_START_ADDR_3_POS))

/* 0x9C : mjpeg_bit_cnt3 */
#define MJENC_MJPEG_BIT_CNT3_OFFSET                             (0x9C)
#define MJENC_FRAME_BIT_CNT_3                                   MJENC_FRAME_BIT_CNT_3
#define MJENC_FRAME_BIT_CNT_3_POS                               (0U)
#define MJENC_FRAME_BIT_CNT_3_LEN                               (32U)
#define MJENC_FRAME_BIT_CNT_3_MSK                               (((1U<<MJENC_FRAME_BIT_CNT_3_LEN)-1)<<MJENC_FRAME_BIT_CNT_3_POS)
#define MJENC_FRAME_BIT_CNT_3_UMSK                              (~(((1U<<MJENC_FRAME_BIT_CNT_3_LEN)-1)<<MJENC_FRAME_BIT_CNT_3_POS))

/* 0x1F0 : mjpeg_debug */
#define MJENC_DEBUG_OFFSET                                      (0x1F0)
#define MJENC_REG_MJENC_DBG_EN                                  MJENC_REG_MJENC_DBG_EN
#define MJENC_REG_MJENC_DBG_EN_POS                              (0U)
#define MJENC_REG_MJENC_DBG_EN_LEN                              (1U)
#define MJENC_REG_MJENC_DBG_EN_MSK                              (((1U<<MJENC_REG_MJENC_DBG_EN_LEN)-1)<<MJENC_REG_MJENC_DBG_EN_POS)
#define MJENC_REG_MJENC_DBG_EN_UMSK                             (~(((1U<<MJENC_REG_MJENC_DBG_EN_LEN)-1)<<MJENC_REG_MJENC_DBG_EN_POS))
#define MJENC_REG_MJENC_DBG_SEL                                 MJENC_REG_MJENC_DBG_SEL
#define MJENC_REG_MJENC_DBG_SEL_POS                             (4U)
#define MJENC_REG_MJENC_DBG_SEL_LEN                             (4U)
#define MJENC_REG_MJENC_DBG_SEL_MSK                             (((1U<<MJENC_REG_MJENC_DBG_SEL_LEN)-1)<<MJENC_REG_MJENC_DBG_SEL_POS)
#define MJENC_REG_MJENC_DBG_SEL_UMSK                            (~(((1U<<MJENC_REG_MJENC_DBG_SEL_LEN)-1)<<MJENC_REG_MJENC_DBG_SEL_POS))

/* 0x1FC : mjpeg_dummy_reg */
#define MJENC_DUMMY_REG_OFFSET                                  (0x1FC)
#define MJENC_DUMMY_REG                                         MJENC_DUMMY_REG
#define MJENC_DUMMY_REG_POS                                     (0U)
#define MJENC_DUMMY_REG_LEN                                     (32U)
#define MJENC_DUMMY_REG_MSK                                     (((1U<<MJENC_DUMMY_REG_LEN)-1)<<MJENC_DUMMY_REG_POS)
#define MJENC_DUMMY_REG_UMSK                                    (~(((1U<<MJENC_DUMMY_REG_LEN)-1)<<MJENC_DUMMY_REG_POS))


struct  mjpeg_reg {
    /* 0x0 : mjpeg_control_1 */
    union {
        struct {
            uint32_t reg_mjpeg_enable               :  1; /* [    0],        r/w,        0x0 */
            uint32_t reg_mjpeg_bit_order            :  1; /* [    1],        r/w,        0x1 */
            uint32_t reg_order_u_even               :  1; /* [    2],        r/w,        0x1 */
            uint32_t reserved_3                     :  1; /* [    3],       rsvd,        0x0 */
            uint32_t reg_q_mode                     :  3; /* [ 6: 4],        r/w,        0x2 */
            uint32_t reserved_7                     :  1; /* [    7],       rsvd,        0x0 */
            uint32_t reg_w_xlen                     :  3; /* [10: 8],        r/w,        0x3 */
            uint32_t reg_last_hf_blk_dmy            :  1; /* [   11],        r/w,        0x0 */
            uint32_t reserved_12_15                 :  4; /* [15:12],       rsvd,        0x0 */
            uint32_t reg_frame_wblk                 :  8; /* [23:16],        r/w,        0xf */
            uint32_t reg_frame_hblk                 :  8; /* [31:24],        r/w,       0x14 */
        }BF;
        uint32_t WORD;
    } mjpeg_control_1;

    /* 0x4 : mjpeg_control_2 */
    union {
        struct {
            uint32_t reg_sw_frame                   :  5; /* [ 4: 0],        r/w,        0x0 */
            uint32_t reserved_5_7                   :  3; /* [ 7: 5],       rsvd,        0x0 */
            uint32_t reg_mjpeg_sw_mode              :  1; /* [    8],        r/w,        0x0 */
            uint32_t reg_mjpeg_sw_run               :  1; /* [    9],        r/w,        0x0 */
            uint32_t reserved_10_11                 :  2; /* [11:10],       rsvd,        0x0 */
            uint32_t reg_yy_dvp2axi_sel             :  2; /* [13:12],        r/w,        0x0 */
            uint32_t reg_uv_dvp2axi_sel             :  2; /* [15:14],        r/w,        0x1 */
            uint32_t reg_mjpeg_wait_cycle           : 16; /* [31:16],        r/w,      0x400 */
        }BF;
        uint32_t WORD;
    } mjpeg_control_2;

    /* 0x08 : mjpeg_yy_frame_addr */
    union {
        struct {
            uint32_t reg_yy_addr_start              : 32; /* [31: 0],        r/w, 0x80000000 */
        }BF;
        uint32_t WORD;
    } mjpeg_yy_frame_addr;

