sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/mm_reg/mjpeg_reg_a0.h
    /* 0x0C : mjpeg_uv_frame_addr */
    union {
        struct {
            uint32_t reg_uv_addr_start              : 32; /* [31: 0],        r/w, 0x80000000 */
        }BF;
        uint32_t WORD;
    } mjpeg_uv_frame_addr;

    /* 0x10 : mjpeg_yuv_mem */
    union {
        struct {
            uint32_t reg_yy_mem_hblk                : 13; /* [12: 0],        r/w,        0x2 */
            uint32_t reserved_13_15                 :  3; /* [15:13],       rsvd,        0x0 */
            uint32_t reg_uv_mem_hblk                : 13; /* [28:16],        r/w,        0x2 */
            uint32_t reserved_29_31                 :  3; /* [31:29],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } mjpeg_yuv_mem;

    /* 0x14 : jpeg_frame_addr */
    union {
        struct {
            uint32_t reg_w_addr_start               : 32; /* [31: 0],        r/w, 0x80400000 */
        }BF;
        uint32_t WORD;
    } jpeg_frame_addr;

    /* 0x18 : jpeg_store_memory */
    union {
        struct {
            uint32_t reg_w_burst_cnt                : 32; /* [31: 0],        r/w,     0x4000 */
        }BF;
        uint32_t WORD;
    } jpeg_store_memory;

    /* 0x1C : mjpeg_control_3 */
    union {
        struct {
            uint32_t reg_int_normal_en              :  1; /* [    0],        r/w,        0x1 */
            uint32_t reg_int_cam_en                 :  1; /* [    1],        r/w,        0x1 */
            uint32_t reg_int_mem_en                 :  1; /* [    2],        r/w,        0x0 */
            uint32_t reg_int_frame_en               :  1; /* [    3],        r/w,        0x0 */
            uint32_t sts_normal_int                 :  1; /* [    4],          r,        0x0 */
            uint32_t sts_cam_int                    :  1; /* [    5],          r,        0x0 */
            uint32_t sts_mem_int                    :  1; /* [    6],          r,        0x0 */
            uint32_t sts_frame_int                  :  1; /* [    7],          r,        0x0 */
            uint32_t mjpeg_idle                     :  1; /* [    8],          r,        0x1 */
            uint32_t mjpeg_func                     :  1; /* [    9],          r,        0x0 */
            uint32_t mjpeg_wait                     :  1; /* [   10],          r,        0x0 */
            uint32_t mjpeg_flsh                     :  1; /* [   11],          r,        0x0 */
            uint32_t mjpeg_mans                     :  1; /* [   12],          r,        0x0 */
            uint32_t mjpeg_manf                     :  1; /* [   13],          r,        0x0 */
            uint32_t axi_read_idle                  :  1; /* [   14],          r,        0x0 */
            uint32_t axi_write_idle                 :  1; /* [   15],          r,        0x0 */
            uint32_t reg_frame_cnt_trgr_int         :  5; /* [20:16],        r/w,        0x0 */
            uint32_t reg_int_idle_en                :  1; /* [   21],        r/w,        0x0 */
            uint32_t sts_idle_int                   :  1; /* [   22],          r,        0x0 */
            uint32_t reserved_23                    :  1; /* [   23],       rsvd,        0x0 */
            uint32_t frame_valid_cnt                :  5; /* [28:24],          r,        0x0 */
            uint32_t reserved_29_31                 :  3; /* [31:29],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } mjpeg_control_3;

    /* 0x20 : mjpeg_frame_fifo_pop */
    union {
        struct {
            uint32_t rfifo_pop                      :  1; /* [    0],        w1p,        0x0 */
            uint32_t reserved_1_7                   :  7; /* [ 7: 1],       rsvd,        0x0 */
            uint32_t reg_int_clr                    :  1; /* [    8],        w1p,        0x0 */
            uint32_t reserved_9_31                  : 23; /* [31: 9],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } mjpeg_frame_fifo_pop;

    /* 0x24  reserved */
    uint8_t RESERVED0x24[28];

    /* 0x40 : mjpeg_Y_frame_read_status_1 */
    union {
        struct {
            uint32_t yy_mem_hblk_r                  : 13; /* [12: 0],          r,        0x0 */
            uint32_t reserved_13_15                 :  3; /* [15:13],       rsvd,        0x0 */
            uint32_t yy_frm_hblk_r                  : 13; /* [28:16],          r,        0x0 */
            uint32_t reserved_29_31                 :  3; /* [31:29],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } mjpeg_Y_frame_read_status_1;

    /* 0x44 : mjpeg_Y_frame_read_status_2 */
    union {
        struct {
            uint32_t yy_wblk_r                      : 13; /* [12: 0],          r,        0x0 */
            uint32_t reserved_13_15                 :  3; /* [15:13],       rsvd,        0x0 */
            uint32_t yy_mem_rnd_r                   :  8; /* [23:16],          r,        0x0 */
            uint32_t yy_frm_cnt_r                   :  8; /* [31:24],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } mjpeg_Y_frame_read_status_2;

    /* 0x48 : mjpeg_Y_frame_write_status */
    union {
        struct {
            uint32_t yy_mem_hblk_w                  : 13; /* [12: 0],          r,        0x0 */
            uint32_t reserved_13_15                 :  3; /* [15:13],       rsvd,        0x0 */
            uint32_t yy_mem_rnd_w                   :  8; /* [23:16],          r,        0x0 */
            uint32_t yy_frm_cnt_w                   :  8; /* [31:24],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } mjpeg_Y_frame_write_status;

    /* 0x4C : mjpeg_UV_frame_read_status_1 */
    union {
        struct {
            uint32_t uv_mem_hblk_r                  : 13; /* [12: 0],          r,        0x0 */
            uint32_t reserved_13_15                 :  3; /* [15:13],       rsvd,        0x0 */
            uint32_t uv_frm_hblk_r                  : 13; /* [28:16],          r,        0x0 */
            uint32_t reserved_29_31                 :  3; /* [31:29],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } mjpeg_UV_frame_read_status_1;

    /* 0x50 : mjpeg_UV_frame_read_status_2 */
    union {
        struct {
            uint32_t uv_wblk_r                      : 13; /* [12: 0],          r,        0x0 */
            uint32_t reserved_13_15                 :  3; /* [15:13],       rsvd,        0x0 */
            uint32_t uv_mem_rnd_r                   :  8; /* [23:16],          r,        0x0 */
            uint32_t uv_frm_cnt_r                   :  8; /* [31:24],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } mjpeg_UV_frame_read_status_2;

    /* 0x54 : mjpeg_UV_frame_write_status */
    union {
        struct {
            uint32_t uv_mem_hblk_w                  : 13; /* [12: 0],          r,        0x0 */
            uint32_t reserved_13_15                 :  3; /* [15:13],       rsvd,        0x0 */
            uint32_t uv_mem_rnd_w                   :  8; /* [23:16],          r,        0x0 */
            uint32_t uv_frm_cnt_w                   :  8; /* [31:24],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } mjpeg_UV_frame_write_status;

