sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/mm_reg/mjpeg_reg_a0.h
    /* 0x58  reserved */
    uint8_t RESERVED0x58[40];

    /* 0x80 : mjpeg_start_addr0 */
    union {
        struct {
            uint32_t frame_start_addr_0             : 32; /* [31: 0],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } mjpeg_start_addr0;

    /* 0x84 : mjpeg_bit_cnt0 */
    union {
        struct {
            uint32_t frame_bit_cnt_0                : 32; /* [31: 0],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } mjpeg_bit_cnt0;

    /* 0x88 : mjpeg_start_addr1 */
    union {
        struct {
            uint32_t frame_start_addr_1             : 32; /* [31: 0],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } mjpeg_start_addr1;

    /* 0x8C : mjpeg_bit_cnt1 */
    union {
        struct {
            uint32_t frame_bit_cnt_1                : 32; /* [31: 0],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } mjpeg_bit_cnt1;

    /* 0x90 : mjpeg_start_addr2 */
    union {
        struct {
            uint32_t frame_start_addr_2             : 32; /* [31: 0],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } mjpeg_start_addr2;

    /* 0x94 : mjpeg_bit_cnt2 */
    union {
        struct {
            uint32_t frame_bit_cnt_2                : 32; /* [31: 0],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } mjpeg_bit_cnt2;

    /* 0x98 : mjpeg_start_addr3 */
    union {
        struct {
            uint32_t frame_start_addr_3             : 32; /* [31: 0],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } mjpeg_start_addr3;

    /* 0x9C : mjpeg_bit_cnt3 */
    union {
        struct {
            uint32_t frame_bit_cnt_3                : 32; /* [31: 0],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } mjpeg_bit_cnt3;

    /* 0xA0 : mjpeg_start_addr4 */
    union {
        struct {
            uint32_t frame_start_addr_4             : 32; /* [31: 0],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } mjpeg_start_addr4;

    /* 0xA4 : mjpeg_bit_cnt4 */
    union {
        struct {
            uint32_t frame_bit_cnt_4                : 32; /* [31: 0],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } mjpeg_bit_cnt4;

    /* 0xA8 : mjpeg_start_addr5 */
    union {
        struct {
            uint32_t frame_start_addr_5             : 32; /* [31: 0],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } mjpeg_start_addr5;

    /* 0xAC : mjpeg_bit_cnt5 */
    union {
        struct {
            uint32_t frame_bit_cnt_5                : 32; /* [31: 0],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } mjpeg_bit_cnt5;

    /* 0xB0 : mjpeg_start_addr6 */
    union {
        struct {
            uint32_t frame_start_addr_6             : 32; /* [31: 0],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } mjpeg_start_addr6;

    /* 0xB4 : mjpeg_bit_cnt6 */
    union {
        struct {
            uint32_t frame_bit_cnt_6                : 32; /* [31: 0],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } mjpeg_bit_cnt6;

    /* 0xB8 : mjpeg_start_addr7 */
    union {
        struct {
            uint32_t frame_start_addr_7             : 32; /* [31: 0],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } mjpeg_start_addr7;

    /* 0xBC : mjpeg_bit_cnt7 */
    union {
        struct {
            uint32_t frame_bit_cnt_7                : 32; /* [31: 0],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } mjpeg_bit_cnt7;

    /* 0xC0 : mjpeg_start_addr_8 */
    union {
        struct {
            uint32_t frame_start_addr_8             : 32; /* [31: 0],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } mjpeg_start_addr_8;

    /* 0xC4 : mjpeg_bit_cnt_8 */
    union {
        struct {
            uint32_t frame_bit_cnt_8                : 32; /* [31: 0],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } mjpeg_bit_cnt_8;

    /* 0xC8 : mjpeg_start_addr_9 */
    union {
        struct {
            uint32_t frame_start_addr_9             : 32; /* [31: 0],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } mjpeg_start_addr_9;

    /* 0xCC : mjpeg_bit_cnt_9 */
    union {
        struct {
            uint32_t frame_bit_cnt_9                : 32; /* [31: 0],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } mjpeg_bit_cnt_9;

    /* 0xD0 : mjpeg_start_addr_a */
    union {
        struct {
            uint32_t frame_start_addr_a             : 32; /* [31: 0],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } mjpeg_start_addr_a;

    /* 0xD4 : mjpeg_bit_cnt_a */
    union {
        struct {
            uint32_t frame_bit_cnt_a                : 32; /* [31: 0],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } mjpeg_bit_cnt_a;

    /* 0xD8 : mjpeg_start_addr_b */
    union {
        struct {
            uint32_t frame_start_addr_b             : 32; /* [31: 0],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } mjpeg_start_addr_b;

    /* 0xDC : mjpeg_bit_cnt_b */
    union {
        struct {
            uint32_t frame_bit_cnt_b                : 32; /* [31: 0],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } mjpeg_bit_cnt_b;

    /* 0xE0 : mjpeg_start_addr_c */
    union {
        struct {
            uint32_t frame_start_addr_c             : 32; /* [31: 0],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } mjpeg_start_addr_c;

    /* 0xE4 : mjpeg_bit_cnt_c */
    union {
        struct {
            uint32_t frame_bit_cnt_c                : 32; /* [31: 0],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } mjpeg_bit_cnt_c;

    /* 0xE8 : mjpeg_start_addr_d */
    union {
        struct {
            uint32_t frame_start_addr_d             : 32; /* [31: 0],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } mjpeg_start_addr_d;

    /* 0xEC : mjpeg_bit_cnt_d */
    union {
        struct {
            uint32_t frame_bit_cnt_d                : 32; /* [31: 0],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } mjpeg_bit_cnt_d;

    /* 0xF0 : mjpeg_start_addr_e */
    union {
        struct {
            uint32_t frame_start_addr_e             : 32; /* [31: 0],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } mjpeg_start_addr_e;

    /* 0xF4 : mjpeg_bit_cnt_e */
    union {
        struct {
            uint32_t frame_bit_cnt_e                : 32; /* [31: 0],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } mjpeg_bit_cnt_e;

    /* 0xF8 : mjpeg_start_addr_f */
    union {
        struct {
            uint32_t frame_start_addr_f             : 32; /* [31: 0],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } mjpeg_start_addr_f;

    /* 0xFC : mjpeg_bit_cnt_f */
    union {
        struct {
            uint32_t frame_bit_cnt_f                : 32; /* [31: 0],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } mjpeg_bit_cnt_f;

    /* 0x100  reserved */
    uint8_t RESERVED0x100[240];

    /* 0x1F0 : mjpeg_debug */
    union {
        struct {
            uint32_t reg_mjpeg_dbg_en               :  1; /* [    0],        r/w,        0x0 */
            uint32_t reserved_1_3                   :  3; /* [ 3: 1],       rsvd,        0x0 */
            uint32_t reg_mjpeg_dbg_sel              :  4; /* [ 7: 4],        r/w,        0x0 */
            uint32_t reserved_8_31                  : 24; /* [31: 8],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } mjpeg_debug;

    /* 0x1f4  reserved */
    uint8_t RESERVED0x1f4[8];

    /* 0x1FC : mjpeg_dummy_reg */
    union {
        struct {
            uint32_t mjpeg_dummy_reg                : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } mjpeg_dummy_reg;

};

typedef volatile struct mjpeg_reg mjpeg_reg_t;


#endif  /* __MJENC_REG_H__ */
